8BitMixtape/8BitMixtapePlatform/avr/boards.txt
menu.bootloader=Bootloader
menu.core=Core

menu.chip=Chip
menu.clock=Clock
menu.bod=B.O.D.
menu.pinmapping=Pin Mapping

##############################################################

teenyriotusbtiny.name=CocoMake7
teenyriotusbtiny.upload.protocol=usbasp
teenyriotusbtiny.upload.maximum_size=5375
teenyriotusbtiny.upload.speed=19200
teenyriotusbtiny.upload.disable_flushing=true
teenyriotusbtiny.upload.tool=avrdude
teenyriotusbtiny.build.mcu=attiny85
teenyriotusbtiny.build.f_cpu=16500000L
teenyriotusbtiny.build.core=teenyriot-core
teenyriotusbtiny.build.variant=teenyriot
teenyriotusbtiny.build.board=AVR_TEENYRIOT
teenyriotusbtiny.upload.protocol=usbasp
teenyriotusbtiny.upload.maximum_size=5375
teenyriotusbtiny.upload.speed=19200
teenyriotusbtiny.upload.disable_flushing=true
teenyriotusbtiny.upload.tool=avrdude
teenyriotusbtiny.bootloader.low_fuses=0xE1
teenyriotusbtiny.bootloader.high_fuses=0x5D
teenyriotusbtiny.bootloader.extended_fuses=0xFE
teenyriotusbtiny.bootloader.file=teenyriot-usbtiny/teenyriot-usbtiny.hex
teenyriotusbtiny.bootloader.tool=arduino:avrdude

teenyriotusbtiny.menu.chip.attiny85=attiny85
teenyriotusbtiny.menu.chip.attiny85.build.mcu=attiny85

teenyriotusbtiny.menu.chip.attiny84=attiny84
teenyriotusbtiny.menu.chip.attiny84.build.mcu=attiny84


###############################################################

teenyriotusbtiny.menu.core.teenyriot=Teenyriot (default)
teenyriotusbtiny.menu.core.teenyriot.core=teenyriot-core
teenyriotusbtiny.menu.core.teenyriot.variant=teenyriot

###############################################################
